In [1]:
# Import modules
from bs4 import BeautifulSoup
import requests
from splinter import Browser
from selenium import webdriver
import pandas as pd
import time
from secret import username, password
from sqlalchemy import create_engine

In [2]:
# URL of page to be scraped
url = 'https://en.wikipedia.org/wiki/List_of_highest-grossing_films'

### Mac (Irina) Connection

In [3]:
# https://splinter.readthedocs.io/en/latest/drivers/chrome.html
!which chromedriver

/usr/local/bin/chromedriver

In [4]:
executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
browser = Browser('chrome', **executable_path, headless=False)

### Windows (Clay) Connection

In [5]:
# executable_path = {'executable_path': 'C:/Users/Clay/chromedriver.exe'}
# browser = Browser('chrome', **executable_path, headless=False)

In [6]:
browser.visit(url)

In [7]:
tables = pd.read_html(url)

In [8]:
table_df = tables[0]

In [9]:
table_df.set_index('Rank')
table_df.head()

   Rank Peak                         Title Worldwide gross  Year Reference(s)
0     1    1             Avengers: Endgame  $2,797,800,564  2019   [# 1][# 2]
1     2    1                        Avatar  $2,790,439,000  2009   [# 3][# 4]
2     3    1                       Titanic  $2,194,439,542  1997   [# 5][# 6]
3     4    3  Star Wars: The Force Awakens  $2,068,223,624  2015   [# 7][# 8]
4     5    4        Avengers: Infinity War  $2,048,359,754  2018  [# 9][# 10]

In [10]:
table_df.drop(columns=['Peak', 'Year', 'Reference(s)'], inplace=True)

In [11]:
table_df = table_df.reset_index()

In [12]:
ww_gross_series = table_df['Worldwide gross']

In [13]:
len(ww_gross_series)

50

In [14]:
type(ww_gross_series)

pandas.core.series.Series

In [15]:
list = []
for i in ww_gross_series:
    print(i.split('$')[-1])
    list.append(i.split('$')[-1])

2,797,800,564
2,790,439,000
2,194,439,542
2,068,223,624
2,048,359,754
1,671,713,208
1,656,943,394
1,518,812,988
1,516,045,911
1,450,026,933
1,402,805,868
1,346,913,161
1,341,932,398
1,332,539,889
1,309,484,461
1,290,000,000
1,263,521,126
1,242,805,359
1,238,764,765
1,214,811,252
1,159,398,397
1,153,304,495
1,148,161,807
1,142,219,401
1,131,927,996
1,128,274,794
1,123,794,079
1,108,561,013
1,104,054,072
1,084,939,099
1,074,251,311
1,074,144,248
1,073,394,593
1,066,969,703
1,066,179,725
1,056,057,273
1,050,693,953
1,045,713,802
1,034,799,409
1,029,939,903
1,028,570,889
1,027,044,677
1,025,467,110
1,023,784,195
1,021,103,568
1,004,934,033
978,087,613
976,920,103
970,761,885
968,483,777

In [16]:
split_list = []
for i in list:
    i = i.split(',')
    split_list.append(''.join(i))

In [17]:
merged_list = []
for i in split_list:
    print(''.join(i))
    merged_list.append(''.join(i))

2797800564
2790439000
2194439542
2068223624
2048359754
1671713208
1656943394
1518812988
1516045911
1450026933
1402805868
1346913161
1341932398
1332539889
1309484461
1290000000
1263521126
1242805359
1238764765
1214811252
1159398397
1153304495
1148161807
1142219401
1131927996
1128274794
1123794079
1108561013
1104054072
1084939099
1074251311
1074144248
1073394593
1066969703
1066179725
1056057273
1050693953
1045713802
1034799409
1029939903
1028570889
1027044677
1025467110
1023784195
1021103568
1004934033
978087613
976920103
970761885
968483777

In [18]:
len(merged_list)

50

In [19]:
merged_list

['2797800564',
 '2790439000',
 '2194439542',
 '2068223624',
 '2048359754',
 '1671713208',
 '1656943394',
 '1518812988',
 '1516045911',
 '1450026933',
 '1402805868',
 '1346913161',
 '1341932398',
 '1332539889',
 '1309484461',
 '1290000000',
 '1263521126',
 '1242805359',
 '1238764765',
 '1214811252',
 '1159398397',
 '1153304495',
 '1148161807',
 '1142219401',
 '1131927996',
 '1128274794',
 '1123794079',
 '1108561013',
 '1104054072',
 '1084939099',
 '1074251311',
 '1074144248',
 '1073394593',
 '1066969703',
 '1066179725',
 '1056057273',
 '1050693953',
 '1045713802',
 '1034799409',
 '1029939903',
 '1028570889',
 '1027044677',
 '1025467110',
 '1023784195',
 '1021103568',
 '1004934033',
 '978087613',
 '976920103',
 '970761885',
 '968483777']

In [20]:
# Rename the columns to be able to merge the data 
table_df.rename(columns={"Title": "name", "Rank": "rank", "Worldwide gross":"ww_gross"}, inplace=True)

In [21]:
# Change revenue column from string to big integer
table_df['ww_gross'] = merged_list

In [22]:
table_df.head()

   index  rank                          name    ww_gross
0      0     1             Avengers: Endgame  2797800564
1      1     2                        Avatar  2790439000
2      2     3                       Titanic  2194439542
3      3     4  Star Wars: The Force Awakens  2068223624
4      4     5        Avengers: Infinity War  2048359754

### Connect to local database

In [23]:
connection_string = f'{username}:{password}@localhost:5432/movies_db'
engine = create_engine(f'postgresql://{connection_string}')

In [24]:
engine.table_names()

['combined_revenue',
 'international_revenue',
 'best_200_directors',
 'domestic_revenue']

### Use pandas to load csv converted DataFrame into database

In [25]:
table_df.to_sql(name='ww_top_50_movies', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the international table

In [26]:
pd.read_sql_query('select * from ww_top_50_movies', con=engine).head()

   index  rank                          name    ww_gross
0      0     1             Avengers: Endgame  2797800564
1      1     2                        Avatar  2790439000
2      2     3                       Titanic  2194439542
3      3     4  Star Wars: The Force Awakens  2068223624
4      4     5        Avengers: Infinity War  2048359754

### Web Scrape Box Office Mojo

In [29]:
mojo_url = 'https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW'

In [30]:
executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
browser = Browser('chrome', **executable_path, headless=False)

In [31]:
browser.visit(mojo_url)

In [32]:
tables = pd.read_html(mojo_url)

In [33]:
numbers_table_df = tables[0]

In [34]:
numbers_table_df

     Rank                                       Title  Lifetime Gross  Year
0       1                           Avengers: Endgame  $2,797,800,564  2019
1       2                                      Avatar  $2,790,439,000  2009
2       3                                     Titanic  $2,195,169,138  1997
3       4  Star Wars: Episode VII - The Force Awakens  $2,068,223,624  2015
4       5                      Avengers: Infinity War  $2,048,359,754  2018
..    ...                                         ...             ...   ...
195   196                                The Revenant    $532,950,503  2015
196   197                                     The Meg    $530,254,422  2016
197   198                   Ralph Breaks the Internet    $529,323,962  2018
198   199       Hotel Transylvania 3: Summer Vacation    $528,583,774  2018
199   200                               The Boss Baby    $527,965,936  2017

[200 rows x 4 columns]

In [35]:
mojo_url_2 = 'https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=200'

In [30]:
executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
browser = Browser('chrome', **executable_path, headless=False)

In [31]:
browser.visit(mojo_url)

In [32]:
tables = pd.read_html(mojo_url)

In [33]:
numbers_table_df = tables[0]

In [34]:
numbers_table_df

     Rank                                       Title  Lifetime Gross  Year
0       1                           Avengers: Endgame  $2,797,800,564  2019
1       2                                      Avatar  $2,790,439,000  2009
2       3                                     Titanic  $2,195,169,138  1997
3       4  Star Wars: Episode VII - The Force Awakens  $2,068,223,624  2015
4       5                      Avengers: Infinity War  $2,048,359,754  2018
..    ...                                         ...             ...   ...
195   196                                The Revenant    $532,950,503  2015
196   197                                     The Meg    $530,254,422  2016
197   198                   Ralph Breaks the Internet    $529,323,962  2018
198   199       Hotel Transylvania 3: Summer Vacation    $528,583,774  2018
199   200                               The Boss Baby    $527,965,936  2017

[200 rows x 4 columns]

In [3]:
mojo_list = []
base_url = 'https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW'
page_num = 0
table_mojo_df = []
table_on_page = ""

for i in range(0, 10200, 200):
    if page_num < 100:
        print("Printing first 200 rows.")
        url=(f"{base_url}")
        print(url)
        executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
        browser = Browser('chrome', **executable_path, headless=False)
        browser.visit(url)
        time.sleep(5)
        print("sleep 5")
        tables = pd.read_html(url)
        time.sleep(5)
        print("sleep 5")
        table_mojo_df = tables[0]
        browser.quit()
        page_num += 200
        table_mojo_df = table_mojo_df.append(table_mojo_df)
        table_page = (f"Table_{str(i)}")
        print(table_page)
        print(type(table_page))
        table_page = table_mojo_df
        print(table_page)
        table_mojo_df.to_csv(f"csv/Table_{str(i)}.csv")
        print('-------------------------------------')
    else:
        print(f"Printing pages {i+1} to {i+200}")
        url=(f"{base_url}&offset={str(i)}")
        print(url)
        executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
        browser = Browser('chrome', **executable_path, headless=False)
        browser.visit(url)
        time.sleep(5)
        print("sleep 5")
        tables = pd.read_html(url)
        time.sleep(5)
        print("sleep 5")
        table_mojo_df = tables[0]
        browser.quit()
        page_num += 200
        table_mojo_df = table_mojo_df.append(table_mojo_df)
#         table_page = str(i)
        table_page = (f"Table_{str(i)}")
        print(table_page)
        print(type(table_page))
        table_page = table_mojo_df
        print(table_page)
        table_mojo_df.to_csv(f"csv/Table_{str(i)}.csv")
        print('-------------------------------------')

Printing first 200 rows.
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW
sleep 5
sleep 5
Table_0
<class 'str'>
     Rank                                       Title  Lifetime Gross  Year
0       1                           Avengers: Endgame  $2,797,800,564  2019
1       2                                      Avatar  $2,790,439,000  2009
2       3                                     Titanic  $2,195,169,138  1997
3       4  Star Wars: Episode VII - The Force Awakens  $2,068,223,624  2015
4       5                      Avengers: Infinity War  $2,048,359,754  2018
..    ...                                         ...             ...   ...
195   196                                The Revenant    $532,950,503  2015
196   197                                     The Meg    $530,254,422  2016
197   198                   Ralph Breaks the Internet    $529,323,962  2018
198   199       Hotel Transylvania 3: Summer Vacation    $528,583,774  2018
199   200                               The Boss Baby    $527,965,936  2017

[400 rows x 4 columns]
-------------------------------------
Printing pages 201 to 400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=200
sleep 5
sleep 5
Table_200
<class 'str'>
     Rank                                       Title Lifetime Gross  Year
0     201                                     Dunkirk   $526,944,695  2017
1     202                                    Godzilla   $524,976,069  2014
2     203                             Sherlock Holmes   $524,028,679  2009
3     204                            Meet the Fockers   $522,657,936  2004
4     205  How to Train Your Dragon: The Hidden World   $521,802,551  2019
..    ...                                         ...            ...   ...
195   396                        Mary Poppins Returns   $349,545,966  2018
196   397                                 Deep Impact   $349,464,664  1998
197   398                                   The Lorax   $348,840,316  2012
198   399                             The Maze Runner   $348,319,861  2014
199   400                                The Smurfs 2   $347,545,360  2013

[400 rows x 4 columns]
-------------------------------------
Printing pages 401 to 600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=400
sleep 5
sleep 5
Table_400
<class 'str'>
     Rank                       Title Lifetime Gross  Year
0     401           National Treasure   $347,512,318  2004
1     402                 Rush Hour 2   $347,325,802  2001
2     403                      Trolls   $346,864,462  2016
3     404  xXx: Return of Xander Cage   $346,118,277  2017
4     405                  Pocahontas   $346,079,773  1995
..    ...                         ...            ...   ...
195   596           Lost in Hong Kong   $256,283,912  2015
196   597             Erin Brockovich   $256,271,286  2000
197   598                     Pegasus   $255,863,112  2019
198   599                 Marley & Me   $255,743,093  2008
199   600                   Halloween   $255,485,178  2018

[400 rows x 4 columns]
-------------------------------------
Printing pages 601 to 800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=600
sleep 5
sleep 5
Table_600
<class 'str'>
     Rank                          Title Lifetime Gross  Year
0     601                             Us   $255,184,580  2019
1     602                    Cliffhanger   $255,000,211  1993
2     603    Baahubali 2: The Conclusion   $254,158,390  2017
3     604                           Babe   $254,134,910  1995
4     605    Men in Black: International   $253,890,701  2019
..    ...                            ...            ...   ...
195   796                            JFK   $205,405,498  1991
196   797               White House Down   $205,366,737  2013
197   798         Fun with Dick and Jane   $204,681,899  2005
198   799                  Eat Pray Love   $204,594,016  2010
199   800  You Don't Mess with the Zohan   $204,313,400  2008

[400 rows x 4 columns]
-------------------------------------
Printing pages 801 to 1000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=800
sleep 5
sleep 5
Table_800
<class 'str'>
     Rank               Title Lifetime Gross  Year
0     801         King Arthur   $203,567,857  2004
1     802           Hairspray   $203,552,922  2007
2     803           Yogi Bear   $203,509,374  2010
3     804             Everest   $203,427,584  2015
4     805         Vanilla Sky   $203,388,341  2001
..    ...                 ...            ...   ...
195   996      Shall We Dance   $170,128,460  2004
196   997     Stuart Little 2   $169,956,806  2002
197   998           Zookeeper   $169,852,759  2011
198   999  Dumb and Dumber To   $169,837,010  2014
199  1000  Ghost in the Shell   $169,801,921  2017

[400 rows x 4 columns]
-------------------------------------
Printing pages 1001 to 1200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1000
sleep 5
sleep 5
Table_1000
<class 'str'>
     Rank                     Title Lifetime Gross  Year
0    1001              Seven Pounds   $169,748,929  2008
1    1002        Meet the Robinsons   $169,333,034  2007
2    1003  The Emperor's New Groove   $169,327,687  2000
3    1004                12 Monkeys   $168,839,459  1995
4    1005                 Dodgeball   $168,423,227  2004
..    ...                       ...            ...   ...
195  1196       Big Momma's House 2   $141,522,961  2006
196  1197                  Die Hard   $141,482,154  1988
197  1198                  Bad Boys   $141,407,024  1995
198  1199           Mona Lisa Smile   $141,337,989  2003
199  1200             Scary Movie 2   $141,220,678  2001

[400 rows x 4 columns]
-------------------------------------
Printing pages 1201 to 1400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1200
sleep 5
sleep 5
Table_1200
<class 'str'>
     Rank                            Title Lifetime Gross  Year
0    1201                      Shallow Hal   $141,069,860  2001
1    1202  The SpongeBob SquarePants Movie   $141,067,127  2004
2    1203                            Evita   $141,047,179  1996
3    1204                The Rugrats Movie   $140,894,675  1998
4    1205                  The Devil's Own   $140,807,547  1997
..    ...                              ...            ...   ...
195  1396                           Allied   $119,520,023  2016
196  1397             Charlie Wilson's War   $119,483,446  2007
197  1398             Fried Green Tomatoes   $119,418,501  1991
198  1399                   On Golden Pond   $119,285,432  1981
199  1400                           Sahara   $119,240,351  2005

[400 rows x 4 columns]
-------------------------------------
Printing pages 1401 to 1600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1400
sleep 5
sleep 5
Table_1400
<class 'str'>
     Rank                                            Title Lifetime Gross  \
0    1401                            Beverly Hills Cop III   $119,208,989
1    1402                                       Unfaithful   $119,137,784
2    1403                                I Belonged to You   $119,107,580
3    1404                                     The Shallows   $119,100,758
4    1405                                    Forever Young   $119,055,731
..    ...                                              ...            ...
195  1596                               The Stepford Wives   $103,370,127
196  1597                                           9 to 5   $103,300,143
197  1598                      Rugrats in Paris: The Movie   $103,291,131
198  1599  Birdman or (The Unexpected Virtue of Ignorance)   $103,215,094
199  1600                                      Cold War II   $103,197,501

     Year
0    1994
1    2002
2    2016
3    2016
4    2017
..    ...
195  2004
196  1980
197  2000
198  2014
199  2016

[400 rows x 4 columns]
-------------------------------------
Printing pages 1601 to 1800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1600
sleep 5
sleep 5
Table_1600
<class 'str'>
     Rank                  Title Lifetime Gross  Year
0    1601         She's All That   $103,166,989  1999
1    1602              Guess Who   $103,121,466  2005
2    1603           Night School   $103,105,878  2018
3    1604           Mary Poppins   $103,078,700  1964
4    1605          Transcendence   $103,039,258  2014
..    ...                    ...            ...   ...
195  1796         Apocalypse Now    $91,968,688  1979
196  1797  Brave Hearts: Umizaru    $91,884,352  2012
197  1798     Behind Enemy Lines    $91,753,202  2001
198  1799   Get Him to the Greek    $91,720,255  2010
199  1800                 Shadow    $91,708,374  2018

[400 rows x 4 columns]
-------------------------------------
Printing pages 1801 to 2000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1800

sleep 5
sleep 5
Table_1800
<class 'str'>
     Rank                Title Lifetime Gross  Year
0    1801  Season of the Witch    $91,627,228  2011
1    1802                Crawl    $91,542,097  2019
2    1803      Five Feet Apart    $91,522,094  2019
3    1804      Friday the 13th    $91,509,154  2009
4    1805    Rambo: Last Blood    $91,490,353  2019
..    ...                  ...            ...   ...
195  1996    Go Away Mr. Tumor    $80,606,893  2015
196  1997        Vampires Suck    $80,547,866  2010
197  1998       Den of Thieves    $80,509,622  2018
198  1999            Halloween    $80,460,948  2007
199  2000  Muppets Most Wanted    $80,383,113  2014

[400 rows x 4 columns]
-------------------------------------
Printing pages 2001 to 2200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2000
sleep 5
sleep 5
Table_2000
<class 'str'>
     Rank                                     Title Lifetime Gross  Year
0    2001                                    Takers    $80,205,382  2010
1    2002                                Hereditary    $80,200,936  2018
2    2003                              Runaway Jury    $80,154,140  2003
3    2004                         Finding Forrester    $80,049,764  2000
4    2005                                 Footloose    $80,035,402  1984
..    ...                                       ...            ...   ...
195  2196     Pokémon: Zoroark: Master of Illusions    $71,143,529  2010
196  2197                            Turner & Hooch    $71,079,915  1989
197  2198                   xXx: State of the Union    $71,022,693  2005
198  2199                             The Counselor    $71,009,334  2013
199  2200  Anacondas: The Hunt for the Blood Orchid    $70,992,898  2004

[400 rows x 4 columns]
-------------------------------------
Printing pages 2201 to 2400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2200
sleep 5
sleep 5
Table_2200
<class 'str'>
     Rank                                 Title Lifetime Gross  Year
0    2201                         Groundhog Day    $70,906,973  1993
1    2202                            Son of God    $70,829,270  2014
2    2203                I Am Not Madame Bovary    $70,826,207  2016
3    2204               Brotherhood of the Wolf    $70,752,904  2001
4    2205              Ferris Bueller's Day Off    $70,712,677  1986
..    ...                                   ...            ...   ...
195  2396                                  Dave    $63,270,710  1993
196  2397                           The Goonies    $63,237,520  1985
197  2398       The Hundred Regiments Offensive    $63,230,000  2015
198  2399  Detective Conan: Crimson Love Letter    $63,147,576  2017
199  2400       Beavis and Butt-Head Do America    $63,118,386  1996

[400 rows x 4 columns]
-------------------------------------
Printing pages 2401 to 2600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2400
sleep 5
sleep 5
Table_2400
<class 'str'>
     Rank                    Title Lifetime Gross  Year
0    2401       Jeepers Creepers 2    $63,102,666  2003
1    2402         The Longest Ride    $62,944,815  2015
2    2403               Unfriended    $62,882,090  2015
3    2404       Piglet's Big Movie    $62,870,546  2003
4    2405  The Mountain Between Us    $62,832,209  2017
..    ...                      ...            ...   ...
195  2596            The Big Chill    $56,399,659  1983
196  2597               15 Minutes    $56,359,980  2001
197  2598      Lucky Number Slevin    $56,308,881  2006
198  2599                    Frida    $56,298,474  2002
199  2600                   A or B    $56,239,049  2018

[400 rows x 4 columns]
-------------------------------------
Printing pages 2601 to 2800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2600
sleep 5
sleep 5
Table_2600
<class 'str'>
     Rank                          Title Lifetime Gross  Year
0    2601               Eastern Promises    $56,107,312  2007
1    2602            Kicking & Screaming    $56,070,433  2005
2    2603                   The Big Shot    $56,040,681  2019
3    2604                    Remember Me    $56,032,889  2010
4    2605  The Odd Life of Timothy Green    $56,012,642  2012
..    ...                            ...            ...   ...
195  2796                    Night Watch    $50,336,279  2004
196  2797               A View to a Kill    $50,327,960  1985
197  2798           Natural Born Killers    $50,282,766  1994
198  2799         Angels in the Outfield    $50,236,831  1994
199  2800                        Dearest    $50,206,306  2008

[400 rows x 4 columns]
-------------------------------------
Printing pages 2801 to 3000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2800
sleep 5
sleep 5
Table_2800
<class 'str'>
     Rank                                   Title Lifetime Gross  Year
0    2801                               Breakdown    $50,159,144  1997
1    2802  HOUBA! On the Trail of the Marsupilami    $50,146,474  2012
2    2803                              The Closet    $50,104,745  2001
3    2804                       National Security    $50,097,949  2003
4    2805                            Little Women    $50,083,616  1994
..    ...                                     ...            ...   ...
195  2996                    Hanson and the Beast    $46,154,323  2017
196  2997                         Eddie the Eagle    $46,152,800  2016
197  2998                       Napoleon Dynamite    $46,138,887  2004
198  2999                           Into the Blue    $46,117,696  2005
199  3000                    For Love of the Game    $46,112,640  1999

[400 rows x 4 columns]
-------------------------------------
Printing pages 3001 to 3200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3000
sleep 5
sleep 5
Table_3000
<class 'str'>
     Rank                          Title Lifetime Gross  Year
0    3001                The World's End    $46,089,287  2013
1    3002                     The Hunted    $46,061,847  2003
2    3003     The Last House on the Left    $45,995,223  2009
3    3004              Let's Get Married    $45,972,724  2015
4    3005                  The Rainmaker    $45,916,769  1997
..    ...                            ...            ...   ...
195  3196                  Balls of Fury    $41,739,766  2007
196  3197                       Oh, God!    $41,687,243  1977
197  3198                      Wimbledon    $41,682,237  2004
198  3199               T2 Trainspotting    $41,681,746  2017
199  3200  Cheech and Chong's Next Movie    $41,675,194  1980

[400 rows x 4 columns]
-------------------------------------
Printing pages 3201 to 3400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3200
sleep 5
sleep 5
Table_3200
<class 'str'>
     Rank                                             Title Lifetime Gross  \
0    3201                                          Overlord    $41,657,844
1    3202                                   Born to Be Wild    $41,644,475
2    3203                                     The Uninvited    $41,633,384
3    3204                                  The Dark Crystal    $41,630,431
4    3205                                   Never Back Down    $41,627,431
..    ...                                               ...            ...
195  3396  Crouching Tiger, Hidden Dragon: Sword of Destiny    $38,659,039
196  3397                                  Basic Instinct 2    $38,629,478
197  3398                         The Great Mouse Detective    $38,625,550
198  3399                                          Accepted    $38,623,262
199  3400                                     Head of State    $38,620,484

     Year
0    2018
1    2011
2    2009
3    1982
4    2008
..    ...
195  2016
196  2006
197  1986
198  2006
199  2003

[400 rows x 4 columns]
-------------------------------------
Printing pages 3401 to 3600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3400
sleep 5
sleep 5
Table_3400
<class 'str'>
     Rank                            Title Lifetime Gross  Year
0    3401       The Ghost and the Darkness    $38,619,405  1996
1    3402                   The Best of Me    $38,609,668  2014
2    3403                           Taxi 5    $38,598,227  2018
3    3404                 On Deadly Ground    $38,590,458  1994
4    3405         Urban Legends: Final Cut    $38,574,362  2000
..    ...                              ...            ...   ...
195  3596  Les Tuche 2: The American Dream    $35,210,425  2016
196  3597               Honeymoon in Vegas    $35,208,854  1992
197  3598                       Courageous    $35,185,884  2011
198  3599    Destiny: The Tale of Kamakura    $35,166,640  2017
199  3600     The Girl in the Spider's Web    $35,164,920  2018

[400 rows x 4 columns]
-------------------------------------
Printing pages 3601 to 3800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3600

sleep 5
sleep 5
Table_3600
<class 'str'>
     Rank                                   Title Lifetime Gross  Year
0    3601    The Adventures of Rocky & Bullwinkle    $35,134,820  2000
1    3602                             Miss Potter    $35,078,241  2006
2    3603                                   Alfie    $35,060,882  2004
3    3604                    My Week with Marilyn    $35,057,696  2011
4    3605                          The Liquidator    $35,046,130  2017
..    ...                                     ...            ...   ...
195  3796  The House That Never Dies: Reawakening    $32,433,588  2017
196  3797                             Black Sheep    $32,417,995  1996
197  3798                  The Invention of Lying    $32,406,507  2009
198  3799                                 Dhoom 2    $32,396,427  2006
199  3800                     Rumble in the Bronx    $32,392,047  1996

[400 rows x 4 columns]
-------------------------------------
Printing pages 3801 to 4000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3800
sleep 5
sleep 5
Table_3800
<class 'str'>
     Rank                                       Title Lifetime Gross  Year
0    3801                                      Stuber    $32,390,945  2019
1    3802       Detective K: Secret of Virtuous Widow    $32,358,664  2011
2    3803                                   Alpha Dog    $32,351,125  2007
3    3804                                    The Wave    $32,350,637  2008
4    3805                Hit Me Anyone One More Time!    $32,333,512  2019
..    ...                                         ...            ...   ...
195  3996  Revenge of the Nerds II: Nerds in Paradise    $30,063,289  1987
196  3997                                 The Getaway    $30,057,974  1994
197  3998                                  Road House    $30,050,028  1989
198  3999                          Point of No Return    $30,038,362  1993
199  4000                             Sophie's Choice    $30,036,000  1982

[400 rows x 4 columns]
-------------------------------------
Printing pages 4001 to 4200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4000
sleep 5
sleep 5
Table_4000
<class 'str'>
     Rank                                          Title Lifetime Gross  Year
0    4001                             Laws of Attraction    $30,031,874  2003
1    4002                         The Gods Must Be Crazy    $30,031,783  1984
2    4003                                        Solaris    $30,002,758  2002
3    4004  A Nightmare on Elm Street 2: Freddy's Revenge    $29,999,213  1985
4    4005                         Natale a Beverly Hills    $29,976,481  2009
..    ...                                            ...            ...   ...
195  4196                                        Default    $27,694,043  2018
196  4197                   Dirty Dancing: Havana Nights    $27,685,016  2004
197  4198                                       Nebraska    $27,682,872  2013
198  4199                                        Traitor    $27,675,014  2008
199  4200                             The Quiet American    $27,674,124  2002

[400 rows x 4 columns]
-------------------------------------
Printing pages 4201 to 4400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4200
sleep 5
sleep 5
Table_4200
<class 'str'>
     Rank                         Title Lifetime Gross  Year
0    4201                    Bride Wars    $27,670,000  2015
1    4202  Murder on the Orient Express    $27,655,657  1974
2    4203                  Ice Princess    $27,645,491  2005
3    4204               The Last Castle    $27,642,707  2001
4    4205                      The Road    $27,639,579  2009
..    ...                           ...            ...   ...
195  4396                   Love, Rosie    $25,574,387  2014
196  4397                    Mr. Donkey    $25,537,759  2016
197  4398                    Funny Farm    $25,537,221  1988
198  4399    The Muppets Take Manhattan    $25,534,703  1984
199  4400                  Halloween II    $25,533,818  1981

[400 rows x 4 columns]
-------------------------------------
Printing pages 4401 to 4600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4400
sleep 5
sleep 5
Table_4400
<class 'str'>
     Rank                           Title Lifetime Gross  Year
0    4401                  Buried Secrets    $25,529,525  2010
1    4402               Only When I Laugh    $25,524,778  1981
2    4403                 Look Who's Back    $25,513,752  2015
3    4404       A Nightmare on Elm Street    $25,504,513  1984
4    4405                           Mimic    $25,480,490  1997
..    ...                             ...            ...   ...
195  4596  Quill: The Life of a Guide Dog    $23,697,809  2004
196  4597                To the Arctic 3D    $23,695,388  2012
197  4598                         Network    $23,690,757  1976
198  4599                 Sixteen Candles    $23,686,027  1984
199  4600               Some Kind of Hero    $23,671,186  1982

[400 rows x 4 columns]
-------------------------------------
Printing pages 4601 to 4800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4600
sleep 5
sleep 5
Table_4600
<class 'str'>
     Rank                                           Title Lifetime Gross  Year
0    4601                     Mad Max 2: The Road Warrior    $23,667,907  1982
1    4602                     The Best Years of Our Lives    $23,656,620  1946
2    4603                                   Two of a Kind    $23,646,952  1983
3    4604                               Anywhere But Here    $23,631,929  1999
4    4605                              Ever Since We Love    $23,620,000  2015
..    ...                                             ...            ...   ...
195  4796                                          Ip Man    $22,108,789  2008
196  4797                                         Lock Up    $22,099,847  1989
197  4798                                The Glass Castle    $22,088,533  2017
198  4799  Detective Conan: Jolly Roger in the Deep Azure    $22,053,994  2007
199  4800                                    The Immature    $22,043,584  2011

[400 rows x 4 columns]
-------------------------------------
Printing pages 4801 to 5000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4800
sleep 5
sleep 5
Table_4800
<class 'str'>
     Rank                     Title Lifetime Gross  Year
0    4801         Me, Them and Lara    $22,039,646  2010
1    4802                Crows Zero    $22,036,607  2007
2    4803         Little Black Book    $22,035,509  2004
3    4804               Big Brother    $22,029,250  2018
4    4805                   Cousins    $22,026,369  1989
..    ...                       ...            ...   ...
195  4996                Speechless    $20,667,959  1994
196  4997  The Man from Snowy River    $20,659,423  1982
197  4998            The Photograph    $20,653,204  2020
198  4999                     Keanu    $20,651,333  2016
199  5000                  Pandorum    $20,648,328  2009

[400 rows x 4 columns]
-------------------------------------
Printing pages 5001 to 5200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5000
sleep 5
sleep 5
Table_5000
<class 'str'>
     Rank              Title Lifetime Gross  Year
0    5001      Super Size Me    $20,645,757  2004
1    5002     The Front Line    $20,629,645  2011
2    5003  A Christmas Story    $20,618,717  1983
3    5004                F/X    $20,603,715  1986
4    5005            Polisse    $20,601,245  2011
..    ...                ...            ...   ...
195  5196             Duplex    $19,322,135  2003
196  5197   The White Ribbon    $19,319,671  2009
197  5198                Joe    $19,319,254  1970
198  5199           EX-Files    $19,310,000  2014
199  5200      Little Giants    $19,306,362  1994

[400 rows x 4 columns]
-------------------------------------
Printing pages 5201 to 5400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5200
sleep 5
sleep 5
Table_5200
<class 'str'>
     Rank                                              Title Lifetime Gross  \
0    5201                                           Cell 211    $19,305,314
1    5202                                      Woman in Love    $19,302,752
2    5203                                          Deep Blue    $19,292,539
3    5204                                      Summer of Sam    $19,288,130
4    5205                                             Mapado    $19,286,223
..    ...                                                ...            ...
195  5396  Everything You Always Wanted to Know About Sex...    $18,090,065
196  5397                                     The Lighthouse    $18,082,592
197  5398                                      Dead Man Down    $18,074,539
198  5399                                             Krrish    $18,041,250
199  5400                 Jo Jo Dancer, Your Life Is Calling    $18,034,150

     Year
0    2009
1    2011
2    2003
3    1999
4    2005
..    ...
195  1972
196  2019
197  2013
198  2006
199  1986

[400 rows x 4 columns]
-------------------------------------
Printing pages 5401 to 5600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5400

sleep 5
sleep 5
Table_5400
<class 'str'>
     Rank                         Title Lifetime Gross  Year
0    5401                From Me to You    $18,033,727  2010
1    5402  Mr. Pride vs. Miss Prejudice    $18,019,651  2017
2    5403                    Cape No. 7    $18,015,600  2008
3    5404             The Country Bears    $18,012,097  2002
4    5405         Harlock: Space Pirate    $18,010,317  2013
..    ...                           ...            ...   ...
195  5596      Kung Pow: Enter the Fist    $16,994,625  2002
196  5597                Death Sentence    $16,974,459  2007
197  5598                Chinese Puzzle    $16,968,297  2013
198  5599          Till Luck Do Us Part    $16,963,608  2012
199  5600                Catch That Kid    $16,951,702  2004

[400 rows x 4 columns]
-------------------------------------
Printing pages 5601 to 5800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5600
sleep 5
sleep 5
Table_5600
<class 'str'>
     Rank                   Title Lifetime Gross  Year
0    5601  Bullyparade: The Movie    $16,943,483  2017
1    5602  Rachel Getting Married    $16,937,968  2008
2    5603       Los ojos de Julia    $16,934,369  2010
3    5604                 The War    $16,928,556  1994
4    5605        The One and Only    $16,928,137  1978
..    ...                     ...            ...   ...
195  5796      Seventy-Seven Days    $15,988,889  2017
196  5797  The Liar and His Lover    $15,983,782  2013
197  5798             The Kitchen    $15,980,032  2019
198  5799   As the Light Goes Out    $15,973,348  2014
199  5800                 Caveman    $15,965,924  1981

[400 rows x 4 columns]
-------------------------------------
Printing pages 5801 to 6000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5800
sleep 5
sleep 5
Table_5800
<class 'str'>
     Rank                                              Title Lifetime Gross  \
0    5801  Gintama the Movie: The Final Chapter - Be Fore...    $15,954,700
1    5802                                          The Words    $15,950,164
2    5803                                Armed and Dangerous    $15,945,534
3    5804                                        Next of Kin    $15,942,628
4    5805                                      Before Sunset    $15,936,507
..    ...                                                ...            ...
195  5996  The Assassination of Jesse James by the Coward...    $15,001,776
196  5997                                             Oldboy    $15,001,764
197  5998                                       Shaolin Girl    $15,000,804
198  5999                             For a Few Dollars More    $15,000,000
199  6000                                      Hükümet Kadin    $14,995,263

     Year
0    2013
1    2012
2    1986
3    1989
4    2004
..    ...
195  2007
196  2003
197  2008
198  1967
199  2013

[400 rows x 4 columns]
-------------------------------------
Printing pages 6001 to 6200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6000
sleep 5
sleep 5
Table_6000
<class 'str'>
     Rank                            Title Lifetime Gross  Year
0    6001     Journey to the South Pacific    $14,994,876  2013
1    6002  Baby: Secret of the Lost Legend    $14,972,297  1985
2    6003                Going by the Book    $14,961,069  2007
3    6004                             Olé!    $14,957,857  2005
4    6005              The Meaning of Life    $14,949,697  1983
..    ...                              ...            ...   ...
195  6196                         The Reef    $14,220,743  2006
196  6197                    Sweet Liberty    $14,205,021  1986
197  6198                    A Chorus Line    $14,202,899  1985
198  6199               If I Were Rich Man    $14,195,149  2019
199  6200                            Proof    $14,189,860  2005

[400 rows x 4 columns]
-------------------------------------
Printing pages 6201 to 6400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6200
sleep 5
sleep 5
Table_6200
<class 'str'>
     Rank                              Title Lifetime Gross  Year
0    6201                  Magic Carpet Ride    $14,188,490  2005
1    6202                  Kukhnya v Parizhe    $14,187,131  2014
2    6203  Tri bogatyrya i printsessa Egipta    $14,184,783  2017
3    6204                 Prince of Darkness    $14,182,492  1987
4    6205                 Confession of Pain    $14,182,296  2006
..    ...                                ...            ...   ...
195  6396                   Closer to Heaven    $13,301,443  2009
196  6397                   Getting Straight    $13,300,000  1970
197  6398    The Adventures of Milo and Otis    $13,299,749  1989
198  6399                  Lord of Illusions    $13,294,422  1995
199  6400                 The Pick-up Artist    $13,290,368  1987

[400 rows x 4 columns]
-------------------------------------
Printing pages 6401 to 6600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6400
sleep 5
sleep 5
Table_6400
<class 'str'>
     Rank                   Title Lifetime Gross  Year
0    6401              The Entity    $13,277,558  1983
1    6402                   Klown    $13,273,759  2010
2    6403        Body of Evidence    $13,273,595  1993
3    6404               Class Act    $13,272,113  1992
4    6405              Vera Drake    $13,267,869  2004
..    ...                     ...            ...   ...
195  6596        Whatcha Wearin'?    $12,534,479  2012
196  6597                 Gattaca    $12,532,777  1997
197  6598  Compromising Positions    $12,531,831  1985
198  6599          Judgment Night    $12,526,677  1993
199  6600         The White Angel    $12,525,709  2007

[400 rows x 4 columns]
-------------------------------------
Printing pages 6601 to 6800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6600
sleep 5
sleep 5
Table_6600
<class 'str'>
     Rank                           Title Lifetime Gross  Year
0    6601                    The Clearing    $12,520,799  2004
1    6602                   Sorority Boys    $12,517,488  2002
2    6603                            Zoom    $12,506,362  2006
3    6604                      Black Mask    $12,504,289  1999
4    6605                The Ages of Love    $12,493,369  2011
..    ...                             ...            ...   ...
195  6796                          Museum    $11,757,642  2016
196  6797    Ryuzo and the Seven Henchmen    $11,757,243  2015
197  6798  The Beat That My Heart Skipped    $11,757,109  2005
198  6799                    C'est Si Bon    $11,750,035  2015
199  6800      There's No Place Like Home    $11,740,817  2018

[400 rows x 4 columns]
-------------------------------------
Printing pages 6801 to 7000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6800
sleep 5
sleep 5
Table_6800
<class 'str'>
     Rank                            Title Lifetime Gross  Year
0    6801                Strictly Ballroom    $11,738,022  1993
1    6802                  I Love Wolffy 2    $11,730,000  2013
2    6803                     Lion's Heart    $11,719,123  2013
3    6804                        Used Cars    $11,715,321  1980
4    6805                   Mary Magdalene    $11,710,110  2018
..    ...                              ...            ...   ...
195  6996                          Dhamaal    $11,077,541  2007
196  6997  Kamen Rider Faiz: Paradise Lost    $11,067,556  2003
197  6998                          Head-On    $11,065,801  2004
198  6999                      Wild Orchid    $11,060,485  1990
199  7000                     Krush Groove    $11,052,713  1985

[400 rows x 4 columns]
-------------------------------------
Printing pages 7001 to 7200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7000
sleep 5
sleep 5
Table_7000
<class 'str'>
     Rank                                              Title Lifetime Gross  \
0    7001                                          Tall Tale    $11,047,627
1    7002                            Horrid Henry: The Movie    $11,045,966
2    7003                                         Last Night    $11,042,068
3    7004                              The Vanished Murderer    $11,040,802
4    7005                                      Promised Land    $11,039,031
..    ...                                                ...            ...
195  7196  Inuyasha the Movie: Affections Touching Across...    $10,539,779
196  7197                                    Moms' Night Out    $10,536,956
197  7198                                           Jo's Boy    $10,531,558
198  7199                                 Where the Boys Are    $10,530,000
199  7200    One Piece: Baron Omatsuri and the Secret Island    $10,522,843

     Year
0    1995
1    2011
2    2010
3    2015
4    2012
..    ...
195  2001
196  2014
197  2011
198  1984
199  2005

[400 rows x 4 columns]
-------------------------------------
Printing pages 7201 to 7400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7200

sleep 5
sleep 5
Table_7200
<class 'str'>
     Rank                                           Title Lifetime Gross  Year
0    7201                                  Thread of Lies    $10,522,797  2014
1    7202                                         Get Low    $10,522,511  2010
2    7203                            Black Widow Business    $10,504,345  2016
3    7204  Até Que a Sorte nos Separe 3: A Falência Final    $10,502,937  2015
4    7205                                        Anatomie    $10,501,958  2000
..    ...                                             ...            ...   ...
195  7396                                    The Deep End    $10,031,529  2001
196  7397                             Tear This Heart Out    $10,031,226  2008
197  7398                Kisarazu Cat's Eye: Nihon Series    $10,029,866  2003
198  7399                                    Agathe Cléry    $10,025,910  2008
199  7400                                     Crying Fist    $10,024,751  2005

[400 rows x 4 columns]
-------------------------------------
Printing pages 7401 to 7600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7400
sleep 5
sleep 5
Table_7400
<class 'str'>
     Rank                                       Title Lifetime Gross  Year
0    7401                                  Dirty Work    $10,023,282  1998
1    7402                         O Candidato Honesto    $10,021,790  2014
2    7403                              Hope and Glory    $10,021,120  1987
3    7404                              The Red Violin    $10,019,109  1998
4    7405                            Cutthroat Island    $10,017,322  1995
..    ...                                         ...            ...   ...
195  7596  Wanko: The Story of Me, My Family and Rock     $9,528,275  2011
196  7597                            Mid-August Lunch     $9,524,517  2008
197  7598                                From the Hip     $9,518,342  1987
198  7599                       Daytime Shooting Star     $9,516,207  2017
199  7600                                     Traffik     $9,515,914  2018

[400 rows x 4 columns]
-------------------------------------
Printing pages 7601 to 7800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7600
sleep 5
sleep 5
Table_7600
<class 'str'>
     Rank                                 Title Lifetime Gross  Year
0    7601                            Death Bell     $9,512,698  2008
1    7602             The Mystery of Henri Pick     $9,510,682  2019
2    7603                    Monsieur Batignole     $9,502,387  2002
3    7604                       Shall We Dance?     $9,499,091  1997
4    7605  The Young and Prodigious T.S. Spivet     $9,494,789  2013
..    ...                                   ...            ...   ...
195  7796                       The Love Letter     $9,041,804  1999
196  7797                 To Steal from a Thief     $9,041,187  2016
197  7798                             Incarnate     $9,037,058  2016
198  7799        Love Is Eternal While It Lasts     $9,035,609  2004
199  7800                            Like Crazy     $9,029,150  2016

[400 rows x 4 columns]
-------------------------------------
Printing pages 7801 to 8000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7800
sleep 5
sleep 5
Table_7800
<class 'str'>
     Rank                      Title Lifetime Gross  Year
0    7801                     Truman     $9,027,600  2015
1    7802               Demon Empire     $9,026,898  2006
2    7803  The Legend of Pig Warrior     $9,023,944  2019
3    7804                     Target     $9,023,199  1985
4    7805                   Trippin'     $9,017,070  1999
..    ...                        ...            ...   ...
195  7996                      Boudu     $8,568,040  2005
196  7997                    Willard     $8,564,586  2003
197  7998                 Leprechaun     $8,556,940  1993
198  7999                 Space Dogs     $8,553,835  2010
199  8000           The Final Master     $8,551,269  2012

[400 rows x 4 columns]
-------------------------------------
Printing pages 8001 to 8200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8000
sleep 5
sleep 5
Table_8000
<class 'str'>
     Rank                                  Title Lifetime Gross  Year
0    8001                    The Rich Man's Wife     $8,543,587  1996
1    8002                         A View of Love     $8,540,794  2010
2    8003  Care Bears Movie II: A New Generation     $8,540,346  1986
3    8004         Connasse, princesse des coeurs     $8,540,288  2015
4    8005                         Without a Clue     $8,539,181  1988
..    ...                                    ...            ...   ...
195  8196                                 Soof 2     $8,095,275  2016
196  8197                      Small Town Rivals     $8,095,062  2007
197  8198                                  Fresh     $8,094,616  1994
198  8199                           The Shootist     $8,091,910  1976
199  8200                        Streets of Fire     $8,089,290  1984

[400 rows x 4 columns]
-------------------------------------
Printing pages 8201 to 8400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8200
sleep 5
sleep 5
Table_8200
<class 'str'>
     Rank                               Title Lifetime Gross  Year
0    8201                     The Company Men     $8,087,000  2011
1    8202  The Adventures of Baron Munchausen     $8,083,123  1989
2    8203                 Whisper If I Forget     $8,079,191  2014
3    8204                            My Giant     $8,072,007  1998
4    8205                      The Crossing 2     $8,070,921  2015
..    ...                                 ...            ...   ...
195  8396                                  No     $7,699,095  2012
196  8397        Anubis: Het pad der 7 zonden     $7,698,532  2008
197  8398                   Mr. & Mrs. Bridge     $7,698,010  1990
198  8399                       Lump of Sugar     $7,697,689  2006
199  8400                        Squadron 303     $7,694,425  2018

[400 rows x 4 columns]
-------------------------------------
Printing pages 8401 to 8600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8400
sleep 5
sleep 5
Table_8400
<class 'str'>
     Rank                           Title Lifetime Gross  Year
0    8401              Declaration of War     $7,691,610  2011
1    8402  The True Story of Puss'N Boots     $7,687,222  2009
2    8403                   Finding Fanny     $7,685,784  2014
3    8404                   Runaway Train     $7,683,620  1985
4    8405               Strictly Business     $7,683,267  1991
..    ...                             ...            ...   ...
195  8596               The Young Messiah     $7,330,338  2016
196  8597                          Broken     $7,326,038  2014
197  8598                     Testosteron     $7,325,461  2007
198  8599             King of the Gypsies     $7,325,177  1978
199  8600             A City Called Macau     $7,322,128  2019

[400 rows x 4 columns]
-------------------------------------
Printing pages 8601 to 8800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8600
sleep 5
sleep 5
Table_8600
<class 'str'>
     Rank                                    Title Lifetime Gross  Year
0    8601                                    Venus     $7,321,309  2006
1    8602                                The Tribe     $7,318,071  2018
2    8603                 The Anderssons in Greece     $7,315,184  2012
3    8604                             Neseli Hayat     $7,314,040  2009
4    8605                            Even the Rain     $7,313,485  2011
..    ...                                      ...            ...   ...
195  8796                                  Shutter     $6,989,456  2004
196  8797                             Painted Fire     $6,988,181  2002
197  8798                          To Each His Own     $6,988,027  2017
198  8799  Team Batista Final: Kerberos No Shouzou     $6,987,812  2014
199  8800                               Relentless     $6,985,999  1989

[400 rows x 4 columns]
-------------------------------------
Printing pages 8801 to 9000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8800

sleep 5
sleep 5
Table_8800
<class 'str'>
     Rank                                              Title Lifetime Gross  \
0    8801                                               Goon     $6,985,158
1    8802                                      Psychokinesis     $6,981,970
2    8803       Children of the Corn II: The Final Sacrifice     $6,980,986
3    8804                                       Donnie Darko     $6,979,093
4    8805                                Kôdaike no hitobito     $6,978,689
..    ...                                                ...            ...
195  8996                                   Forced Vengeance     $6,660,333
196  8997                             Where the Buffalo Roam     $6,659,377
197  8998                                        Son of Saul     $6,659,121
198  8999  InuYasha the Movie 3: Swords of an Honorable R...     $6,654,841
199  9000                                        April Fools     $6,652,777

     Year
0    2012
1    2018
2    1993
3    2001
4    2016
..    ...
195  1982
196  1980
197  2015
198  2003
199  2015

[400 rows x 4 columns]
-------------------------------------
Printing pages 9001 to 9200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9000
sleep 5
sleep 5
Table_9000
<class 'str'>
     Rank                 Title Lifetime Gross  Year
0    9001                  Meow     $6,651,598  2017
1    9002           Swing Shift     $6,650,206  1984
2    9003  It's a Free World...     $6,645,036  2007
3    9004            Lost White     $6,640,736  2016
4    9005            Mucize Ask     $6,640,389  2019
..    ...                   ...            ...   ...
195  9196               Duelist     $6,324,945  2005
196  9197     Inside or Outside     $6,323,457  2016
197  9198          Song Of Love     $6,323,085  2019
198  9199    Traffic Department     $6,322,254  2013
199  9200    Little Miss Marker     $6,321,392  1980

[400 rows x 4 columns]
-------------------------------------
Printing pages 9201 to 9400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9200
sleep 5
sleep 5
Table_9200
<class 'str'>
     Rank                                    Title Lifetime Gross  Year
0    9201  The Legend of the Mummies of Guanajuato     $6,321,314  2014
1    9202                            The Merciless     $6,321,112  2017
2    9203                   More Ants in the Pants     $6,320,626  2002
3    9204                     Hae-jeok, Disco King     $6,320,365  2002
4    9205          Kizumonogatari Part 1: Tekketsu     $6,319,100  2016
..    ...                                      ...            ...   ...
195  9396                        The Cemetery Club     $6,011,745  1993
196  9397                 Matru's Bijlee's Mandola     $6,009,116  2013
197  9398                           Eight Ranger 2     $6,007,941  2014
198  9399                          The Illusionist     $6,007,194  2010
199  9400                          A French Gigolo     $6,006,729  2008

[400 rows x 4 columns]
-------------------------------------
Printing pages 9401 to 9600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9400
sleep 5
sleep 5
Table_9400
<class 'str'>
     Rank                      Title Lifetime Gross  Year
0    9401  What Fault Is It of Ours?     $6,005,497  2003
1    9402                  Radio Day     $5,998,707  2008
2    9403           Beyond the Limit     $5,997,566  1983
3    9404               Now or Never     $5,995,963  2000
4    9405   Blue Exorcist: The Movie     $5,994,921  2012
..    ...                        ...            ...   ...
195  9596       The House by the Sea     $5,720,804  2017
196  9597             The Lonely Guy     $5,718,573  1984
197  9598                      Furie     $5,717,640  2019
198  9599    The 100th Love with You     $5,716,791  2017
199  9600             Like for Likes     $5,715,555  2016

[400 rows x 4 columns]
-------------------------------------
Printing pages 9601 to 9800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9600
sleep 5
sleep 5
Table_9600
<class 'str'>
     Rank                                   Title Lifetime Gross  Year
0    9601                                  Wisdom     $5,715,174  1987
1    9602                       Who's Your Caddy?     $5,713,425  2007
2    9603                                 11 A.M.     $5,713,402  2013
3    9604                        The Viral Factor     $5,712,014  2012
4    9605                               Surrender     $5,711,976  1987
..    ...                                     ...            ...   ...
195  9796                          Man of Tai Chi     $5,464,885  2013
196  9797  Seven Days of Himawari and Her Puppies     $5,463,914  2013
197  9798                  Kagi-dorobô no mesoddo     $5,463,837  2012
198  9799                        Butterfly Lovers     $5,461,411  2008
199  9800                       Shinjuku Incident     $5,461,200  2009

[400 rows x 4 columns]
-------------------------------------
Printing pages 9801 to 10000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9800
sleep 5
sleep 5
Table_9800
<class 'str'>
      Rank                                              Title Lifetime Gross  \
0     9801                                               G@me     $5,460,574
1     9802            That's a Crazy Little Thing Called Love     $5,459,981
2     9803                                       Frozen River     $5,457,664
3     9804                                   125 Years Memory     $5,453,160
4     9805                                          Thank You     $5,452,347
..     ...                                                ...            ...
195   9996               Vampire Sisters 2: Bats in the Belly     $5,182,195
196   9997  Born in the Exile: Sandaime J Soul Brothers no...     $5,181,032
197   9998       All-Round Appraiser Q: The Eyes of Mona Lisa     $5,180,116
198   9999                                        War of Love     $5,179,068
199  10000                                             The Ex     $5,178,640

     Year
0    2003
1    2016
2    2008
3    2015
4    2011
..    ...
195  2014
196  2016
197  2014
198  2010
199  2007

[400 rows x 4 columns]
-------------------------------------
Printing pages 10001 to 10200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=10000
sleep 5
sleep 5
Table_10000
<class 'str'>
      Rank                          Title Lifetime Gross  Year
0    10001       Bañeros 4: Los rompeolas     $5,176,467  2014
1    10002     Two Faces of My Girlfriend     $5,175,448  2007
2    10003                   Intermission     $5,175,215  2003
3    10004        Skoryy 'Moskva-Rossiya'     $5,173,335  2014
4    10005     S.O.S.: Women to the Sea 2     $5,169,793  2015
..     ...                            ...            ...   ...
195  10196                 Swiss Army Man     $4,935,501  2016
196  10197                      Mes héros     $4,934,927  2012
197  10198          Nymphomaniac: Vol. II     $4,934,725  2014
198  10199                The Hairdresser     $4,934,394  2010
199  10200  Sgt. Stubby: An American Hero     $4,932,694  2018

[400 rows x 4 columns]
-------------------------------------

In [47]:
type(table_page)

pandas.core.frame.DataFrame

In [53]:
table_page.tail()

     Rank                          Title Lifetime Gross  Year
195   796                            JFK   $205,405,498  1991
196   797               White House Down   $205,366,737  2013
197   798         Fun with Dick and Jane   $204,681,899  2005
198   799                  Eat Pray Love   $204,594,016  2010
199   800  You Don't Mess with the Zohan   $204,313,400  2008

In [53]:
table_page.tail()

     Rank                          Title Lifetime Gross  Year
195   796                            JFK   $205,405,498  1991
196   797               White House Down   $205,366,737  2013
197   798         Fun with Dick and Jane   $204,681,899  2005
198   799                  Eat Pray Love   $204,594,016  2010
199   800  You Don't Mess with the Zohan   $204,313,400  2008

In [54]:
table_mojo_df.head()

   Rank                        Title Lifetime Gross  Year
0   601                           Us   $255,184,580  2019
1   602                  Cliffhanger   $255,000,211  1993
2   603  Baahubali 2: The Conclusion   $254,158,390  2017
3   604                         Babe   $254,134,910  1995
4   605  Men in Black: International   $253,890,701  2019

In [55]:
table_mojo_df.tail()

     Rank                          Title Lifetime Gross  Year
195   796                            JFK   $205,405,498  1991
196   797               White House Down   $205,366,737  2013
197   798         Fun with Dick and Jane   $204,681,899  2005
198   799                  Eat Pray Love   $204,594,016  2010
199   800  You Don't Mess with the Zohan   $204,313,400  2008

In [58]:
test = str(400)

## Prepare international revenue data set for loading to SQL

In [30]:
# Read the clean, combined csv file
master_df = pd.read_csv("Master_Table.csv")

In [29]:
# Remove duplicated indexes
clean_df = master_df.drop(index=master_df.index[[6643, 8994]])

In [32]:
# Getting the duplicate movie by title and year released. 
duplicated_master_df = master_df.loc[master_df.duplicated(subset=["Title","Year"]), "Title"].unique()
duplicated_master_df

array(['War of the Buttons', 'My Love'], dtype=object)

In [33]:
# Get all the data for the duplicate movie 
duplicated_master_df = master_df.loc[master_df["Title"] == "War of the Buttons"]
duplicated_master_df

      Rank               Title  Year Lifetime Gross  GrossNumeric
5983  5984  War of the Buttons  2011   $15,082,409       15082409
6643  6644  War of the Buttons  2011   $12,326,773       12326773

In [34]:
# Get all the data for the duplicate movie 
duplicated_master_df = master_df.loc[master_df["Title"] == "My Love"]
duplicated_master_df

      Rank    Title  Year Lifetime Gross  GrossNumeric
5334  5335  My Love  2007   $18,525,631       18525631
8994  8995  My Love  2007    $6,660,413        6660413

In [35]:
# reset index
master_df.reset_index()

,index,Rank,Title,Year,Lifetime Gross,GrossNumeric
0,0,1,Avengers: Endgame,2019,"$2,797,800,564",2797800564
1,1,2,Avatar,2009,"$2,790,439,000",2790439000
2,2,3,Titanic,1997,"$2,195,169,138",2195169138
3,3,4,Star Wars: Episode VII - The Force Awakens,2015,"$2,068,223,624",2068223624
4,4,5,Avengers: Infinity War,2018,"$2,048,359,754",2048359754
...,...,...,...,...,...,...
10195,10195,10196,Swiss Army Man,2016,"$4,935,501",4935501
10196,10196,10197,Mes héros,2012,"$4,934,927",4934927
10197,10197,10198,Nymphomaniac: Vol. II,2014,"$4,934,725",4934725
10198,10198,10199,The Hairdresser,2010,"$4,934,394",4934394
10199,10199,10200,Sgt. Stubby: An American Hero,2018,"$4,932,694",4932694

In [36]:
# Drop row by index
clean_df = master_df.drop(index=master_df.index[[6643, 8994]])

In [37]:
len(clean_df)

10198

In [38]:
# Select columns
clean_df = clean_df[['Rank', 'Title', 'Year', 'GrossNumeric']]

In [39]:
# Rename columns
international_v2 = clean_df.rename(columns={'Rank': 'rank', 'Title': 'name_international', 
                'Year': 'year', 'GrossNumeric': 'international_revenue_usd'})

In [40]:
international_v2.head()

,rank,name_international,year,international_revenue_usd
0,1,Avengers: Endgame,2019,2797800564
1,2,Avatar,2009,2790439000
2,3,Titanic,1997,2195169138
3,4,Star Wars: Episode VII - The Force Awakens,2015,2068223624
4,5,Avengers: Infinity War,2018,2048359754

In [41]:
international_v2.set_index('rank', inplace=True)

In [42]:
international_v2.head()

,name_international,year,international_revenue_usd
rank,,,
1,Avengers: Endgame,2019,2797800564
2,Avatar,2009,2790439000
3,Titanic,1997,2195169138
4,Star Wars: Episode VII - The Force Awakens,2015,2068223624
5,Avengers: Infinity War,2018,2048359754

In [43]:
# Change name column to lower case to easier join 
international_v2['name_international'] = international_v2['name_international'].str.capitalize()

In [44]:
international_v2.head()

,name_international,year,international_revenue_usd
rank,,,
1,Avengers: endgame,2019,2797800564
2,Avatar,2009,2790439000
3,Titanic,1997,2195169138
4,Star wars: episode vii - the force awakens,2015,2068223624
5,Avengers: infinity war,2018,2048359754

In [45]:
international_v2.to_csv('Resources/Master_table_v3.csv')

### Clean domestic revenue data¶

In [46]:
# Read csv file into df
domestic_df = pd.read_csv('Resources/datasets_movies_v3.csv')

In [48]:
# Make names capitalized
domestic_df['name'] = domestic_df['name'].str.capitalize()

In [49]:
# Drop year and country columns
domestic_df = domestic_df.drop(columns=['year','country'])

In [50]:
domestic_df.head()

,budget,company,director,genre,gross,name,rating,released,runtime,score,star,votes,writer
0,8000000,Columbia Pictures Corporation,Rob Reiner,Adventure,52287414,Stand by me,R,8/22/86,89,8.1,Wil Wheaton,299174,Stephen King
1,6000000,Paramount Pictures,John Hughes,Comedy,70136369,Ferris bueller's day off,PG-13,6/11/86,103,7.8,Matthew Broderick,264740,John Hughes
2,15000000,Paramount Pictures,Tony Scott,Action,179800601,Top gun,PG,5/16/86,110,6.9,Tom Cruise,236909,Jim Cash
3,18500000,Twentieth Century Fox Film Corporation,James Cameron,Action,85160248,Aliens,R,7/18/86,137,8.4,Sigourney Weaver,540152,James Cameron
4,9000000,Walt Disney Pictures,Randal Kleiser,Adventure,18564613,Flight of the navigator,PG,8/1/86,90,6.9,Joey Cramer,36636,Mark H. Baker

In [51]:
# Getting the duplicate movie by title and year released. 
duplicated_domestic_df = domestic_df.loc[domestic_df.duplicated(subset=["name"]), "name"].unique()
duplicated_domestic_df

array(['Dream lover', 'Boiling point', "Nobody's fool", 'Heat',
       'It takes two', 'Rumpelstiltskin', 'Hamlet', 'Bulletproof',
       'The cure', 'Gladiator', 'Chocolat', 'Where the heart is',
       'Saving grace', 'The in crowd', 'Behind enemy lines', 'Out cold',
       'Pulse', 'Insomnia', 'Hero', 'Bad company', 'Crossroads',
       'The rookie', 'The hunted', 'It runs in the family',
       'The phantom of the opera', 'Man on fire', 'Taxi', 'Proof',
       'The proposition', 'Fever pitch', 'Man of the house', 'Invincible',
       'The guardian', 'Running scared', 'Fearless', 'Black sheep',
       'Hairspray', 'Sunshine', 'The hitcher', 'Flawless', 'Twilight',
       'The eye', 'Mother', 'The stepfather', 'The unborn',
       "Everybody's fine", 'Trust', 'Fair game', 'Death at a funeral',
       'Morning glory', 'The girl with the dragon tattoo', 'Priest',
       'The three musketeers', 'Jane eyre', 'Unknown', 'Trespass',
       'The avengers', 'Les misèrables', 'Anna karenina', 'Project x',
       'Safe', 'Deadfall', 'Great expectations', 'Playing for keeps',
       'Much ado about nothing', 'Promised land', 'Cocktail', 'Frozen',
       'Rush', 'Beautiful creatures', 'The host', 'Stalingrad',
       'Hercules', 'Godzilla', 'Robocop', 'Teenage mutant ninja turtles',
       'Leviathan', 'The gift', 'Fantastic four', 'Concussion',
       'No escape', 'Hot pursuit', 'Max', 'Sing', 'Passengers', 'Voraz',
       'Masterminds'], dtype=object)

In [52]:
# Check duplicated movie
duplicated_domestic_df = domestic_df.loc[domestic_df["name"] == "Dream lover"]
duplicated_domestic_df

,budget,company,director,genre,gross,name,rating,released,runtime,score,star,votes,writer
192,0,Metro-Goldwyn-Mayer (MGM),Alan J. Pakula,Crime,502237,Dream lover,R,4/2/86,104,5.1,Kristy McNichol,405,Jon Boorstin
1652,0,PolyGram Filmed Entertainment,Nicholas Kazan,Drama,256264,Dream lover,R,5/6/94,103,6.2,James Spader,3327,Nicholas Kazan

In [55]:
# Drop duplicates and keep first
domestic_revenue_v2 = domestic_df.drop_duplicates(subset=['name'], keep='first')
len(domestic_revenue_v2)

6731

In [58]:
domestic_revenue_v2 = domestic_revenue_v2.rename(columns={'gross': 'domestic_revenue_usd',
                                        'name': 'name_domestic'})

In [60]:
domestic_revenue_v2.head(2)

,budget,company,director,genre,domestic_revenue_usd,name_domestic,rating,released,runtime,score,star,votes,writer
0,8000000,Columbia Pictures Corporation,Rob Reiner,Adventure,52287414,Stand by me,R,8/22/86,89,8.1,Wil Wheaton,299174,Stephen King
1,6000000,Paramount Pictures,John Hughes,Comedy,70136369,Ferris bueller's day off,PG-13,6/11/86,103,7.8,Matthew Broderick,264740,John Hughes

In [61]:
# Write to csv file
domestic_revenue_v2.to_csv('Resources/Domestic_v3.csv')

### Use pandas to push data into database

In [62]:
# Connect to the local database
connection_string = f'{username}:{password}@localhost:5432/movies_db'
engine = create_engine(f'postgresql://{connection_string}')

In [63]:
# Check existing tables
engine.table_names()

['combined_revenue',
 'ww_top_50_movies',
 'international_revenue',
 'best_200_directors',
 'domestic_revenue']

In [64]:
# Create international revenue table in the database
international_v2.to_sql(name='international_revenue', con=engine, if_exists='append', index=False)

In [65]:
# Create domesic revenue table in the database
domestic_revenue_v2.to_sql(name='domestic_revenue', con=engine, if_exists='append', index=False)

In [66]:
engine.table_names()

['combined_revenue',
 'ww_top_50_movies',
 'international_revenue',
 'best_200_directors',
 'domestic_revenue']

### Confirm data has been added by querying the international table

In [69]:
pd.read_sql_query("select * from international_revenue", con=engine).head(2)

  name_international  year  international_revenue_usd
0  Avengers: endgame  2019                 2797800564
1             Avatar  2009                 2790439000

In [70]:
pd.read_sql_query('select * from domestic_revenue', con=engine).head(2)

,budget,company,director,genre,domestic_revenue_usd,name_domestic,rating,released,runtime,score,star,votes,writer
0,8000000,Columbia Pictures Corporation,Rob Reiner,Adventure,52287414,Stand by me,R,8/22/86,89,8.1,Wil Wheaton,299174,Stephen King
1,6000000,Paramount Pictures,John Hughes,Comedy,70136369,Ferris bueller's day off,PG-13,6/11/86,103,7.8,Matthew Broderick,264740,John Hughes

### Best movie directors of all times - web scraping

In [72]:
# Setup the urls for scraping
best_director_url  = 'https://www.imdb.com/list/ls056848274/'
best_director_url2 = 'https://www.imdb.com/list/ls056848274/?sort=list_order,asc&mode=detail&page=2'

In [73]:
# Setup the browser
executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
browser = Browser('chrome', **executable_path, headless=False)

In [74]:
# Visit the browser
browser.visit(best_director_url)

In [76]:
# get results by h3
results = browser.find_by_css("h3")

In [77]:
# Read the text from h3 elements in the results
list_original = []
for i in results:
    print(i.text)
    list_original.append(i.text)

1. Steven Spielberg
2. Martin Scorsese
3. Alfred Hitchcock
4. Stanley Kubrick
5. Quentin Tarantino
6. Orson Welles
7. Francis Ford Coppola
8. Ridley Scott
9. Akira Kurosawa
10. Joel Coen
11. Ethan Coen
12. John Ford
13. Sergio Leone
14. Woody Allen
15. Billy Wilder
16. Clint Eastwood
17. Frank Capra
18. Charles Chaplin
19. Christopher Nolan
20. Roman Polanski
21. Ingmar Bergman
22. David Lynch
23. Fritz Lang
24. David Fincher
25. Peter Jackson
26. Federico Fellini
27. Tim Burton
28. James Cameron
29. Sidney Lumet
30. Brian De Palma
31. François Truffaut
32. Terrence Malick
33. David Cronenberg
34. William Wyler
35. Robert Zemeckis
36. Ang Lee
37. Howard Hawks
38. George Lucas
39. Mel Brooks
40. Terry Gilliam
41. Milos Forman
42. Steven Soderbergh
43. John Huston
44. Werner Herzog
45. Oliver Stone
46. David Lean
47. Danny Boyle
48. Rob Reiner
49. Buster Keaton
50. Michael Curtiz
51. Sam Raimi
52. Michael Mann
53. Robert Altman
54. Sam Peckinpah
55. Peter Weir
56. Spike Lee
57. Jean Renoir
58. Andrei Tarkovsky
59. Elia Kazan
60. John Cassavetes
61. Vincente Minnelli
62. Hayao Miyazaki
63. Frank Darabont
64. Kathryn Bigelow
65. George Cukor
66. Ron Howard
67. John Carpenter
68. Guy Ritchie
69. Tony Scott
70. Gus Van Sant
71. Preston Sturges
72. Sergei M. Eisenstein
73. David O. Russell
74. John Frankenheimer
75. Blake Edwards
76. Ernst Lubitsch
77. Jonathan Demme
78. Alejandro G. Iñárritu
79. Sam Mendes
80. Guillermo del Toro
81. Joseph L. Mankiewicz
82. Satyajit Ray
83. Paul Thomas Anderson
84. Wes Anderson
85. Alfonso Cuarón
86. Paul Verhoeven
87. F.W. Murnau
88. Robert Wise
89. Franco Zeffirelli
90. Paul Greengrass
91. F.W. Murnau
92. Don Siegel
93. Vittorio De Sica
94. John Hughes
95. Robert Rodriguez
96. Zack Snyder
97. Mel Gibson
98. Luis Buñuel
99. Greta Gerwig
100. Krzysztof Kieslowski
List Activity
Tell Your Friends
Other Lists by ketedy
Recently Viewed

In [78]:
# Clean up the list
directors_list_100 = list_original[:100]
directors_list_100

['1. Steven Spielberg',
 '2. Martin Scorsese',
 '3. Alfred Hitchcock',
 '4. Stanley Kubrick',
 '5. Quentin Tarantino',
 '6. Orson Welles',
 '7. Francis Ford Coppola',
 '8. Ridley Scott',
 '9. Akira Kurosawa',
 '10. Joel Coen',
 '11. Ethan Coen',
 '12. John Ford',
 '13. Sergio Leone',
 '14. Woody Allen',
 '15. Billy Wilder',
 '16. Clint Eastwood',
 '17. Frank Capra',
 '18. Charles Chaplin',
 '19. Christopher Nolan',
 '20. Roman Polanski',
 '21. Ingmar Bergman',
 '22. David Lynch',
 '23. Fritz Lang',
 '24. David Fincher',
 '25. Peter Jackson',
 '26. Federico Fellini',
 '27. Tim Burton',
 '28. James Cameron',
 '29. Sidney Lumet',
 '30. Brian De Palma',
 '31. François Truffaut',
 '32. Terrence Malick',
 '33. David Cronenberg',
 '34. William Wyler',
 '35. Robert Zemeckis',
 '36. Ang Lee',
 '37. Howard Hawks',
 '38. George Lucas',
 '39. Mel Brooks',
 '40. Terry Gilliam',
 '41. Milos Forman',
 '42. Steven Soderbergh',
 '43. John Huston',
 '44. Werner Herzog',
 '45. Oliver Stone',
 '46. David Lean',
 '47. Danny Boyle',
 '48. Rob Reiner',
 '49. Buster Keaton',
 '50. Michael Curtiz',
 '51. Sam Raimi',
 '52. Michael Mann',
 '53. Robert Altman',
 '54. Sam Peckinpah',
 '55. Peter Weir',
 '56. Spike Lee',
 '57. Jean Renoir',
 '58. Andrei Tarkovsky',
 '59. Elia Kazan',
 '60. John Cassavetes',
 '61. Vincente Minnelli',
 '62. Hayao Miyazaki',
 '63. Frank Darabont',
 '64. Kathryn Bigelow',
 '65. George Cukor',
 '66. Ron Howard',
 '67. John Carpenter',
 '68. Guy Ritchie',
 '69. Tony Scott',
 '70. Gus Van Sant',
 '71. Preston Sturges',
 '72. Sergei M. Eisenstein',
 '73. David O. Russell',
 '74. John Frankenheimer',
 '75. Blake Edwards',
 '76. Ernst Lubitsch',
 '77. Jonathan Demme',
 '78. Alejandro G. Iñárritu',
 '79. Sam Mendes',
 '80. Guillermo del Toro',
 '81. Joseph L. Mankiewicz',
 '82. Satyajit Ray',
 '83. Paul Thomas Anderson',
 '84. Wes Anderson',
 '85. Alfonso Cuarón',
 '86. Paul Verhoeven',
 '87. F.W. Murnau',
 '88. Robert Wise',
 '89. Franco Zeffirelli',
 '90. Paul Greengrass',
 '91. F.W. Murnau',
 '92. Don Siegel',
 '93. Vittorio De Sica',
 '94. John Hughes',
 '95. Robert Rodriguez',
 '96. Zack Snyder',
 '97. Mel Gibson',
 '98. Luis Buñuel',
 '99. Greta Gerwig',
 '100. Krzysztof Kieslowski']

In [80]:
# Remove the rating from the string
clean_list1 = []
for i in directors_list_100:
    director = i.split('. ')[-1]
    print(director)
    clean_list1.append(director)

Steven Spielberg
Martin Scorsese
Alfred Hitchcock
Stanley Kubrick
Quentin Tarantino
Orson Welles
Francis Ford Coppola
Ridley Scott
Akira Kurosawa
Joel Coen
Ethan Coen
John Ford
Sergio Leone
Woody Allen
Billy Wilder
Clint Eastwood
Frank Capra
Charles Chaplin
Christopher Nolan
Roman Polanski
Ingmar Bergman
David Lynch
Fritz Lang
David Fincher
Peter Jackson
Federico Fellini
Tim Burton
James Cameron
Sidney Lumet
Brian De Palma
François Truffaut
Terrence Malick
David Cronenberg
William Wyler
Robert Zemeckis
Ang Lee
Howard Hawks
George Lucas
Mel Brooks
Terry Gilliam
Milos Forman
Steven Soderbergh
John Huston
Werner Herzog
Oliver Stone
David Lean
Danny Boyle
Rob Reiner
Buster Keaton
Michael Curtiz
Sam Raimi
Michael Mann
Robert Altman
Sam Peckinpah
Peter Weir
Spike Lee
Jean Renoir
Andrei Tarkovsky
Elia Kazan
John Cassavetes
Vincente Minnelli
Hayao Miyazaki
Frank Darabont
Kathryn Bigelow
George Cukor
Ron Howard
John Carpenter
Guy Ritchie
Tony Scott
Gus Van Sant
Preston Sturges
Eisenstein
Russell
John Frankenheimer
Blake Edwards
Ernst Lubitsch
Jonathan Demme
Iñárritu
Sam Mendes
Guillermo del Toro
Mankiewicz
Satyajit Ray
Paul Thomas Anderson
Wes Anderson
Alfonso Cuarón
Paul Verhoeven
Murnau
Robert Wise
Franco Zeffirelli
Paul Greengrass
Murnau
Don Siegel
Vittorio De Sica
John Hughes
Robert Rodriguez
Zack Snyder
Mel Gibson
Luis Buñuel
Greta Gerwig
Krzysztof Kieslowski

In [81]:
# Open second page
browser.visit(best_director_url2)

In [82]:
results2 = browser.find_by_css("h3")

In [83]:
original_list2 = []
for i in results2:
#     print(i.text)
    original_list2.append(i.text)

In [84]:
directors_list2 = original_list2[:100]

In [85]:
clean_list2 = []
for i in directors_list2:
    director = i.split('. ')[-1]
    clean_list2.append(director)

In [86]:
clean_list2

['Jean-Luc Godard',
 'Tom Hooper',
 'William Friedkin',
 'Antoine Fuqua',
 'Sydney Pollack',
 'Bernardo Bertolucci',
 'John Lasseter',
 'David Ayer',
 'Abrams',
 'Mike Nichols',
 'Lars von Trier',
 'John Milius',
 'John McTiernan',
 'Costa-Gavras',
 'DeMille',
 'Darren Aronofsky',
 'Luc Besson',
 'Doug Liman',
 'Bryan Singer',
 'Richard Linklater',
 'Anthony Minghella',
 'Curtis Hanson',
 'Michael Haneke',
 'Griffith',
 'Alan Parker',
 'Edgar Wright',
 'Pedro Almodóvar',
 'Barry Levinson',
 'Michelangelo Antonioni',
 'Cameron Crowe',
 'Jim Jarmusch',
 'Vittorio De Sica',
 'Spike Jonze',
 'Harold Ramis',
 'Michael Moore',
 'Shane Meadows',
 'Ken Loach',
 'Bobby Farrelly',
 'Jacques Audiard',
 'Gore Verbinski',
 'Jay Roach',
 'Jim Sheridan',
 'John Landis',
 'Richard Donner',
 'Jason Reitman',
 'Robert Redford',
 'Andrew Dominik',
 'Joss Whedon',
 'George Miller',
 'David Zucker',
 'Romero',
 'Mike Leigh',
 'Russell',
 'Neil Jordan',
 'Wilfred Jackson',
 'Pakula',
 'George Roy Hill',
 'Michael Powell',
 'Richard Donner',
 'John Woo',
 'Sofia Coppola',
 'Sofia Coppola',
 'Takashi Miike',
 'Brad Bird',
 'Alex Gibney',
 'Bob Foss',
 'Carol Reed',
 'Christopher Guest',
 'Otto Preminger',
 'Peter Bogdanovich',
 'David Yates',
 'Wes Craven',
 'Kevin Smith',
 'Fred Zinnemann',
 'Ava DuVernay',
 'Jean-Pierre Jeunet',
 'George Stevens',
 'Frank Lloyd',
 'Wim Wenders',
 'Georges Méliès',
 'Wolfgang Petersen',
 'Leo McCarey',
 'Lewis Milestone',
 'Éric Rohmer',
 'Lilly Wachowski',
 'Neill Blomkamp',
 'Warren Beatty',
 'Pier Paolo Pasolini',
 'Kar-Wai Wong',
 'Robert Bresson',
 'Emir Kusturica',
 'Yasujirô Ozu',
 'John Lasseter',
 'Michael Haneke',
 'Takeshi Kitano',
 'Theodoros Angelopoulos',
 'James Whale',
 'Terence Fisher',
 'Chuck Jones',
 'Luchino Visconti']

In [88]:
# Combined two lists together
directors = clean_list1 + clean_list2

In [89]:
len(directors)

200

In [90]:
directors_df = pd.DataFrame(directors)

In [91]:
len(directors_df)

200

In [92]:
# Rename the column
directors_df.rename(columns={0: 'directors'}, inplace=True)

In [93]:
directors_df.reset_index()

     index               directors
0        0        Steven Spielberg
1        1         Martin Scorsese
2        2        Alfred Hitchcock
3        3         Stanley Kubrick
4        4       Quentin Tarantino
..     ...                     ...
195    195  Theodoros Angelopoulos
196    196             James Whale
197    197          Terence Fisher
198    198             Chuck Jones
199    199        Luchino Visconti

[200 rows x 2 columns]

In [94]:
# Save directors to csv
directors_df.to_csv('Resources/Best_directors_200.csv')

#### Push Directors df to the database

In [95]:
directors_df.to_sql(name='best_200_directors', con=engine, if_exists='append', index=False)

In [96]:
# Check if written
pd.read_sql_query('select * from best_200_directors', con=engine).head()

           directors
0   Steven Spielberg
1    Martin Scorsese
2   Alfred Hitchcock
3    Stanley Kubrick
4  Quentin Tarantino

In [97]:
engine.table_names()

['combined_revenue',
 'ww_top_50_movies',
 'international_revenue',
 'best_200_directors',
 'domestic_revenue']